{
  "backend/main.mo": "Main Motoko actor for KBR Silks backend defining data types (Saree, Order, Customer, UserProfile) and CRUD operations for sarees, orders, customers, and user profiles, with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Add Saree' button fix in AdminSarees.tsx (enabling it once the actor is initialized) is implemented with high confidence, referencing test REQ-1.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files describing their purpose, key changes, and design decisions for the KBR Silks application.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell with the page title set to 'KBR Silks' and a root div where the React app mounts.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for the catalog, an /admin redirect to /admin/sarees, and three admin pages each wrapped in OwnerVerificationGate.",
  "frontend/src/components/Layout.tsx": "App shell component rendering a sticky royal-maroon header with the KBR Silks logo, navigation links (public and admin), an announcement bar, and a WhatsApp CTA.",
  "frontend/src/components/OrderPlacementModal.tsx": "Modal dialog for placing a saree order, collecting customer name, phone, and quantity, then calling the usePlaceOrder mutation and showing a success state on completion.",
  "frontend/src/components/OwnerVerificationGate.tsx": "A two-step authentication gate component that requires both a local phone/password verification and an Internet Identity login before rendering admin-protected children.",
  "frontend/src/config/constants.ts": "Centralizes business configuration constants including phone numbers, WhatsApp link, and the list of authorized owner phone numbers for admin access.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using the current Internet Identity for authenticated calls and initializing access control with an admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useOwnerAuth.ts": "A hook that manages local owner verification via phone number or admin password, persisting the verified state in sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend CRUD operations on sarees, orders, customers, and user profiles using the ICP actor.",
  "frontend/src/index.css": "Global stylesheet defining the KBR Silks brand design system with custom OKLCH color tokens, typography (Cormorant Garamond, Playfair Display, Lato), and reusable component styles for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminCustomers.tsx": "Admin page for managing customers with a table view, add/edit modal with form validation, and hooks for fetching, adding, and updating customer records.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders in a sortable table, with inline status update dropdowns and formatted date/price display using order and status hooks.",
  "frontend/src/pages/AdminSarees.tsx": "Admin page for managing saree inventory with add/edit/delete modals, image upload with compression, and actor-based backend interaction.",
  "frontend/src/pages/Catalog.tsx": "Public-facing saree catalog page with filtering, saree cards, image handling, order placement modal, static testimonials, and WhatsApp inquiry links.",
  "frontend/src/utils/imageCompression.ts": "Utility that compresses an image file to JPEG using the Canvas API, progressively reducing quality and dimensions to stay within the 1.4MB IC message limit.",
  "frontend/src/utils/retryWithBackoff.ts": "Provides a generic exponential backoff retry wrapper for async functions and a helper to convert raw backend/IC errors into user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts, extended color tokens (maroon, gold, ivory, sidebar, chart), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for a saree management app, tracking a known issue where the 'Add Saree' button in the admin panel is non-functional and needs to open the add saree modal once the actor is initialized."
}