{
  "backend/main.mo": "Main Motoko actor for the KBR Silks backend, defining data types (Saree, Order, Customer, UserProfile) and CRUD operations for sarees, orders, customers, and user profiles with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (client-side image compression, upload progress indicator, retry logic with backoff) to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for the project's frontend structure and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes using OKLCH color values for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "Minimal HTML shell with the browser tab title set to 'KBR Silks' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with four routes: a public catalog at '/' and three admin routes (/admin/sarees, /admin/orders, /admin/customers) each wrapped in OwnerVerificationGate.",
  "frontend/src/components/Layout.tsx": "Persistent app shell providing a sticky branded header with KBR Silks logo, conditional admin navigation links (shown only when owner is verified), mobile menu, and a footer.",
  "frontend/src/components/OrderPlacementModal.tsx": "Dialog modal for placing orders from the catalog, collecting customer name, phone, and quantity, then calling usePlaceOrder and invalidating the orders query cache on success to show a confirmation screen with the order ID.",
  "frontend/src/components/OwnerVerificationGate.tsx": "A gate component that renders children only after the user submits an authorized owner phone number, showing a styled lock screen form with error handling otherwise.",
  "frontend/src/config/constants.ts": "Centralizes business contact configuration including primary/alternate phone numbers, a WhatsApp link, and the list of authorized owner phone numbers for admin access.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an authenticated identity if available or falling back to anonymous, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useOwnerAuth.ts": "A hook that manages owner verification state via sessionStorage, exposing functions to verify a phone number against the authorized owner list and clear the session.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching, adding, updating, and deleting sarees, orders, and customers via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind, and defines the Silk Splendor brand design tokens (crimson, gold, ivory) for both light and dark modes along with reusable component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminCustomers.tsx": "Admin page for managing customers, providing a table view with add/edit functionality via a modal form that validates name, phone, email, and address fields.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders in a sortable table, allowing inline order status updates via a styled dropdown select with optimistic UI.",
  "frontend/src/pages/AdminSarees.tsx": "Admin page for managing saree inventory with add, edit, and delete operations, including image upload with client-side compression and progress tracking.",
  "frontend/src/pages/Catalog.tsx": "Public-facing saree catalog page with search/filter UI, displaying saree cards with fabric badges, stock indicators, pricing, and an order placement modal.",
  "frontend/src/utils/imageCompression.ts": "Client-side image compression utility using the Canvas API that resizes and reduces JPEG quality iteratively to keep images under the Internet Computer's ~2MB message size limit.",
  "frontend/src/utils/retryWithBackoff.ts": "Generic async retry utility with exponential backoff, plus a helper that parses backend errors into user-friendly messages covering size limits, auth, timeouts, and network failures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and cleaning URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Playfair Display, Cormorant Garamond, Lato), OKLCH-based color tokens (brand colors: crimson, gold, ivory, teal), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a saree e-commerce shop on ICP, documenting known upload timeout issues, planned fixes (image compression, retry logic, better error handling, optimized backend storage), and feature request statuses."
}