{
  "backend/main.mo": "Main Motoko actor for the KBR Silks backend, defining data types (Saree, Order, Customer, UserProfile) and CRUD operations for sarees, orders, customers, and user profiles with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the alternate phone number in frontend/src/config/constants.ts was updated to 7981314611, with high confidence and a single test ID REQ-1.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for build planning and code navigation.",
  "frontend/index.css": "Root CSS file that sets up Tailwind base/components/utilities layers and defines OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point that sets the browser tab title to 'KBR Silks' and mounts the React app via src/main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with four routes (catalog at '/', and three admin routes) where all admin routes are wrapped in OwnerVerificationGate for access control.",
  "frontend/src/components/Layout.tsx": "Persistent app shell component rendering a sticky branded header with navigation (public and conditional admin links), mobile menu, and a footer; imports business phone constants from the config.",
  "frontend/src/components/OrderPlacementModal.tsx": "Modal dialog component for placing a saree order, collecting customer name, phone, and quantity with validation, then calling the usePlaceOrder mutation and showing a success state with order ID.",
  "frontend/src/components/OwnerVerificationGate.tsx": "A gate component that renders children only after the user successfully verifies their phone number as an authorized owner, otherwise showing a styled login form with error handling.",
  "frontend/src/config/constants.ts": "Centralizes business configuration including display/raw phone numbers, a WhatsApp chat link, and the list of authorized owner phone numbers for admin access.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using the current Internet Identity and an admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useOwnerAuth.ts": "A hook that manages owner verification state via sessionStorage, exposing functions to verify a phone number against the authorized owner list and clear the session.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations (sarees, orders, customers, profiles), wrapping actor calls with caching, invalidation, and retry logic.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, defines the Silk Splendor brand design tokens (crimson, gold, ivory) for light and dark modes via CSS custom properties, and declares reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/pages/AdminCustomers.tsx": "Admin page for managing customers with a table view and a modal form for adding or editing customer records (name, phone, email, address) with validation.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders in a sortable table, with inline status update dropdowns and formatted date/price display.",
  "frontend/src/pages/AdminSarees.tsx": "Admin page for managing saree inventory with CRUD operations, image upload with client-side compression, form validation, and error handling.",
  "frontend/src/pages/Catalog.tsx": "Public-facing saree catalog page with filterable/searchable saree cards, stock status display, and an order placement modal trigger.",
  "frontend/src/utils/imageCompression.ts": "Client-side image compression utility using the Canvas API that resizes and reduces JPEG quality to keep images under the Internet Computer's ~2MB message size limit.",
  "frontend/src/utils/retryWithBackoff.ts": "Generic async retry utility with exponential backoff and a helper that parses backend errors into user-friendly messages for common failure cases.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those values via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom fonts, OKLCH-based color tokens (including brand colors like crimson, gold, ivory), border radius, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking schema version, existing features, and feature requests; currently records a completed task to update the alternate phone number to 7981314611 in the app's constants file."
}