{
  "backend/main.mo": "Main Motoko actor for the KBR Silks backend, defining data types (Saree, Order, Customer, UserProfile) and CRUD operations for sarees, orders, customers, and user profiles with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing three features related to React Query cache invalidation for the saree catalog, ensuring fresh data fetching and correct image rendering after admin panel updates.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing their purpose, key changes, and notable implementation details for the KBR Silks app.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind base/components/utilities and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React app with the browser tab title set to 'KBR Silks' and a root div for mounting the React application.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with four routes: the public Catalog at '/' and three admin routes (/admin/sarees, /admin/orders, /admin/customers) each wrapped in OwnerVerificationGate.",
  "frontend/src/components/Layout.tsx": "Persistent app shell component providing a sticky branded header with conditional admin navigation links (shown only when owner is verified), mobile menu, and a footer.",
  "frontend/src/components/OrderPlacementModal.tsx": "Modal dialog for placing a saree order from the catalog, collecting customer name, phone, and quantity, then calling the placeOrder mutation and invalidating the orders query cache on success.",
  "frontend/src/components/OwnerVerificationGate.tsx": "A gate component that renders children only after the user successfully verifies their phone number as an authorized owner, otherwise displaying a styled login form.",
  "frontend/src/config/constants.ts": "Centralizes business configuration including display phone numbers, WhatsApp link, and the list of authorized owner phone numbers for admin access.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, using an authenticated identity if available, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useOwnerAuth.ts": "A hook that manages owner authentication by verifying a phone number against the authorized list and persisting the verified state in sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching, adding, updating, and deleting sarees, orders, customers, and user profiles.",
  "frontend/src/index.css": "Global stylesheet defining the KBR Silks brand design system with custom OKLCH color tokens, typography (Cormorant Garamond, Playfair Display, Lato), and reusable component classes for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminCustomers.tsx": "Admin page for managing customers with a table view and a modal form for adding or editing customer records (name, phone, email, address) using React Query mutations.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders in a sortable table, with inline status dropdowns that trigger backend updates and color-coded status badges.",
  "frontend/src/pages/AdminSarees.tsx": "Admin page for managing saree inventory with CRUD operations, including a form modal that handles image upload with client-side compression, validation, and error reporting.",
  "frontend/src/pages/Catalog.tsx": "Public-facing saree catalog page with search/filter UI, saree cards showing image, fabric type, stock, and price, and an order placement modal trigger.",
  "frontend/src/utils/imageCompression.ts": "Client-side image compression utility using the Canvas API that resizes and reduces JPEG quality iteratively to keep files under the Internet Computer's ~2MB message size limit.",
  "frontend/src/utils/retryWithBackoff.ts": "Generic async retry utility with exponential backoff and a helper that parses backend errors into user-friendly messages covering size limits, auth, timeouts, and network failures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts, OKLCH-based color tokens (including brand colors like crimson, gold, ivory), border radius, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for KBR Silks describing the app's admin/user panel architecture, a known bug where admin-added sarees don't appear in the user catalog, and three existing fix features targeting React Query cache invalidation and image rendering."
}