{
  "backend/main.mo": "Main Motoko actor for KBR Silks backend defining data types (Saree, Order, Customer, UserProfile) and CRUD operations for sarees, orders, and customers, with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing their purpose and recent changes across styling, hooks, pages, and components.",
  "frontend/index.css": "Root CSS file setting up Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point for the KBR Silks frontend app, mounting the React app at the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for the catalog, admin redirect, and three admin pages (sarees, orders, customers), each admin route wrapped in an OwnerVerificationGate.",
  "frontend/src/components/Layout.tsx": "App shell component rendering a sticky maroon header with KBR Silks logo, announcement bar, responsive navigation (public and admin links), and a full footer with contact and brand info.",
  "frontend/src/components/OrderPlacementModal.tsx": "Modal dialog for placing a saree order, collecting customer name, phone, and quantity with validation, then calling the placeOrder mutation and showing a success state with order ID.",
  "frontend/src/components/OwnerVerificationGate.tsx": "A gate component that renders children only if the owner is verified, otherwise displays a styled login form accepting a phone number or admin password.",
  "frontend/src/config/constants.ts": "Centralizes business configuration including phone numbers, WhatsApp link, and the list of authorized owner phone numbers for admin access.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and persisted identity state across page reloads.",
  "frontend/src/hooks/useOwnerAuth.ts": "A hook that manages owner/admin authentication by verifying an input against authorized phone numbers or a hardcoded admin password, persisting verification state in sessionStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching, adding, updating, and deleting sarees, orders, customers, and user profiles via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet defining the KBR Silks brand design system with custom OKLCH color tokens, Tailwind base/component/utility layers, typography, and reusable UI component styles for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminCustomers.tsx": "Admin page for managing customers, providing a table view with add/edit functionality via a modal form that validates name, phone, email, and address fields.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders in a sortable table, allowing inline order status updates via a styled dropdown select with optimistic UI.",
  "frontend/src/pages/AdminSarees.tsx": "Admin page for managing saree inventory with add, edit, and delete operations, including image upload with compression and a confirmation dialog for deletions.",
  "frontend/src/pages/Catalog.tsx": "Public-facing saree catalog page with filtering, a product grid with order/WhatsApp CTAs, static testimonials, and an order placement modal.",
  "frontend/src/utils/imageCompression.ts": "Utility that compresses an image file to JPEG using the Canvas API, progressively reducing quality and dimensions to stay within the 1.4MB IC message limit.",
  "frontend/src/utils/retryWithBackoff.ts": "Provides a generic exponential-backoff retry helper and a function that converts raw backend/IC errors into user-friendly error messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Playfair Display, Cormorant Garamond, Lato), and an extended color palette using OKLCH CSS variables including brand tokens for maroon, gold, and ivory.",
  "project_state.json": "Project state descriptor for a saree management app, tracking two pending fix requests: correcting backend admin authorization for the addSaree function and aligning frontend auth context so admins verified via password/phone gate can successfully add sarees."
}