{
  "backend/main.mo": "Main Motoko actor for the KBR Silks backend, defining data types (Saree, Order, Customer, UserProfile) and CRUD operations for sarees, orders, customers, and user profiles with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping three React Query cache invalidation features (for saree mutations in admin and catalog views) to their implementation file, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing the purpose and key implementation details of each component, hook, page, and config file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "HTML shell for the React app with the browser tab title set to 'KBR Silks' and a root div for mounting the React application.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for the public Catalog page and three admin pages (sarees, orders, customers), each admin route wrapped in OwnerVerificationGate.",
  "frontend/src/components/Layout.tsx": "Persistent app shell component rendering a sticky branded header with navigation (public and conditional admin links), mobile menu, and a footer; uses owner auth state to show or hide admin nav items.",
  "frontend/src/components/OrderPlacementModal.tsx": "A modal dialog component that collects customer name, phone, and quantity to place a saree order, showing a success state with order ID on completion and invalidating the orders cache.",
  "frontend/src/components/OwnerVerificationGate.tsx": "A gate component that renders children only after the user enters an authorized owner phone number, storing verification state in sessionStorage.",
  "frontend/src/config/constants.ts": "Centralizes business configuration constants including display phone numbers, WhatsApp link, and the list of authorized owner phone numbers for admin access.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useOwnerAuth.ts": "A hook that verifies an owner phone number against a whitelist and persists the verification result in sessionStorage for the current browser session.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for sarees, orders, and customers, wrapping backend actor calls for CRUD operations with cache invalidation on mutations.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind with a custom silk/luxury brand design token palette (crimson, gold, ivory) for both light and dark modes, and defines reusable component utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminCustomers.tsx": "Admin page for managing customers with a table view and a modal dialog for adding or editing customer records using React Query mutations.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all orders in a sortable table with inline status update dropdowns backed by React Query.",
  "frontend/src/pages/AdminSarees.tsx": "Admin page for managing saree inventory with add/edit/delete modals, client-side image compression, upload progress, and error handling.",
  "frontend/src/pages/Catalog.tsx": "Public-facing saree catalog page with search/filter, saree cards showing images and details, and an order placement modal.",
  "frontend/src/utils/imageCompression.ts": "Browser Canvas API utility that compresses and resizes image files to stay under the Internet Computer's ~2MB message size limit.",
  "frontend/src/utils/retryWithBackoff.ts": "Generic async retry utility with exponential backoff and a helper that parses backend errors into user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist/retrieve values via sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the KBR Silks frontend, defining dark mode, custom fonts (Playfair Display, Cormorant Garamond, Lato), OKLCH-based color tokens (brand colors: crimson, gold, ivory, teal), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for KBR Silks (a saree management app), documenting a known bug where sarees added in the admin panel don't reflect in the UI, with three existing fix-targeted features focused on React Query cache invalidation after saree mutations."
}