{
  "kind": "build_request",
  "title": "Fix saree catalog sync: admin uploads not reflecting in user panel",
  "projectName": "KBR Silks",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "After a saree is successfully added or updated in the admin panel (AdminSarees.tsx), the React Query cache for the saree catalog must be invalidated so the user-facing Catalog page (Catalog.tsx) immediately reflects the new or updated saree without requiring a manual page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "After adding the sarees in admin page it is showing uploaded but not updated in the user panel"
        ]
      },
      "acceptanceCriteria": [
        "After submitting a new saree in the admin panel, the saree appears in the user-facing catalog without a page reload.",
        "After editing an existing saree in the admin panel, the updated details (including image) are reflected in the catalog without a page reload.",
        "The React Query query key used to fetch sarees in Catalog.tsx is invalidated upon successful add/update mutations in AdminSarees.tsx.",
        "No stale saree data is shown in the catalog after an admin operation completes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Audit the saree list query in useQueries.ts to ensure it fetches fresh data from the backend when the cache is invalidated, and that the query key is consistent between AdminSarees.tsx and Catalog.tsx so cache invalidation works correctly across both pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "After adding the sarees in admin page it is showing uploaded but not updated in the user panel"
        ]
      },
      "acceptanceCriteria": [
        "The saree list query key in useQueries.ts is a single shared constant referenced by both the admin and catalog pages.",
        "Invalidating the saree list query key triggers a re-fetch in the Catalog page.",
        "The useSarees (or equivalent) query does not use staleTime or cacheTime settings that would prevent re-fetching after invalidation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure that saree images uploaded via the admin panel (stored as blobs in the backend) are correctly fetched and rendered in the user-facing Catalog page after a cache invalidation, so newly added sarees display their images and not a broken/empty image placeholder.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "After adding the sarees in admin page it is showing uploaded but not updated in the user panel"
        ]
      },
      "acceptanceCriteria": [
        "Newly added sarees display their uploaded image correctly in the catalog.",
        "The image blob data returned from the backend is properly converted to a displayable URL (e.g., via a Blob URL or base64) in the Catalog page.",
        "No broken image icons appear for freshly added sarees."
      ]
    }
  ],
  "constraints": [
    "Do not change the backend data model or CRUD API.",
    "Do not modify any files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Real-time / WebSocket-based live updates between admin and user sessions.",
    "Changes to the admin UI layout or saree form fields.",
    "Any backend schema migration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}