{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix saree list not updating after add/edit in both admin and user panels",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure AdminSarees page immediately reflects changes after add/update/delete operations without manual refresh",
      "acceptanceCriteria": [
        "When a saree is added via the admin panel form and saved, the saree list in AdminSarees updates immediately to show the new saree without a page reload.",
        "When a saree is edited and saved, the updated saree details appear immediately in the AdminSarees list.",
        "When a saree is deleted, it disappears from the AdminSarees list immediately.",
        "The React Query invalidation for the sarees query key fires on mutation success in all three cases (add, update, delete)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add queryClient.invalidateQueries({ queryKey: ['sarees'] }) in the onSuccess callback of useAddSaree, useUpdateSaree, and useDeleteSaree mutations to ensure the sarees list cache is invalidated and refetched immediately after each mutation completes successfully."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure public Catalog page reflects latest saree data after admin panel mutations without manual refresh",
      "acceptanceCriteria": [
        "After adding a saree in the admin panel, navigating to the Catalog shows the new saree.",
        "After updating a saree in the admin panel, the Catalog reflects the updated details.",
        "After deleting a saree in the admin panel, the Catalog no longer shows the deleted saree.",
        "The same React Query key is used for the sarees list across AdminSarees and Catalog so invalidation propagates to both."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that both useGetAllSarees (used by Catalog) and the saree mutations use the consistent query key ['sarees'] so that invalidation in REQ-1 automatically propagates to the Catalog page. If a different key is currently in use, unify it to ['sarees'] across all saree-related queries and mutations."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Audit and fix React Query configuration to ensure proper cache invalidation and refetching for sarees",
      "acceptanceCriteria": [
        "All three saree mutation hooks (addSaree, updateSaree, deleteSaree) invalidate the sarees query cache on success.",
        "The sarees query key used in AdminSarees and Catalog is consistent or both are invalidated.",
        "The QueryClient staleTime for the sarees query is set to a value that allows fresh fetches after mutations (0 or a short interval).",
        "No stale cached data is served to either panel after a mutation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Review the QueryClient configuration and ensure staleTime for sarees queries is set to 0 or a short interval (e.g., 1000ms) to prevent serving stale cached data after mutations. Verify that refetchOnMount and refetchOnWindowFocus are enabled for sarees queries to ensure fresh data is fetched when navigating between admin and catalog pages."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Confirm all saree mutation hooks include proper error handling and that onSuccess callbacks are executed. Add explicit queryClient.invalidateQueries calls for the ['sarees'] key in useAddSaree, useUpdateSaree, and useDeleteSaree if not already present. Ensure no conditional logic prevents invalidation from executing."
        }
      ]
    }
  ]
}