{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin panel saree upload: image compression, retry logic, and better error handling",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add client-side image compression before upload to keep images under the Internet Computer's message size limit",
      "acceptanceCriteria": [
        "Images are compressed client-side before being included in the backend call",
        "Compressed image size is visibly under 1.5MB before submission",
        "The compression happens automatically without requiring user action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/imageCompression.ts",
          "operation": "create",
          "description": "Create a utility module that compresses images client-side using browser-native Canvas API. Export a compressImage function that accepts a File, target max size (1.5MB), and quality parameters, returning a compressed Blob with metadata including final file size. Use the blob-storage component's ExternalBlob.fromBytes() to prepare the compressed image for upload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminSarees.tsx",
          "operation": "modify",
          "description": "Import and integrate the imageCompression utility into the saree add/edit modal form. When a user selects an image file, automatically compress it and display the compressed file size to the user before they submit. Store the compressed image data in the form state. Update the image upload handling to use ExternalBlob.fromBytes() with the compressed data. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add visible upload progress indicator and loading state to prevent multiple submissions",
      "acceptanceCriteria": [
        "A progress bar or spinner is shown during saree submission",
        "The submit button is disabled while the upload is in progress",
        "User receives clear visual feedback that the operation is being processed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSarees.tsx",
          "operation": "modify",
          "description": "Add upload progress tracking to the saree modal using the blob-storage component's ExternalBlob.withUploadProgress() method to monitor image upload percentage. Display a progress bar or percentage indicator in the modal during submission. Disable the submit button and show a loading spinner while the mutation is in progress (use the mutation's isPending state). Ensure the modal cannot be closed while uploading. Verify the blob-storage component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add automatic retry logic with exponential backoff and descriptive error messages for failed saree submissions",
      "acceptanceCriteria": [
        "Failed saree submissions are automatically retried up to 3 times",
        "Retries use exponential backoff (e.g., 1s, 2s, 4s delays)",
        "After all retries fail, a descriptive error message is shown (not just 'try again')",
        "Error message distinguishes between image-too-large and general network failure where possible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/retryWithBackoff.ts",
          "operation": "create",
          "description": "Create a generic retry utility that wraps async functions with exponential backoff retry logic. Accept parameters for max attempts (default 3) and base delay (default 1000ms). Return both the result and any accumulated errors. Export a helper function to parse backend error responses and generate user-friendly error messages that distinguish between image-too-large errors (StorageError containing size/limit info) and network/timeout errors."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Wrap the addSaree and updateSaree mutations with the retry utility from retryWithBackoff.ts. Configure retry logic to attempt up to 3 times with exponential backoff (1s, 2s, 4s). Parse backend error responses to extract descriptive error messages from the StorageError variant. Map errors to user-friendly messages that explain whether the image is too large, network failed, or another issue occurred. Pass these error messages to the mutation's onError callback for display in the AdminSarees modal."
        },
        {
          "path": "frontend/src/pages/AdminSarees.tsx",
          "operation": "modify",
          "description": "Display detailed error messages from the mutation's error state in the saree modal. Show the descriptive error message returned from the retry logic (e.g., 'Image size exceeds 1.5MB limit' or 'Network timeout after 3 attempts'). Style the error message prominently using alert or toast UI components. Clear the error message when the user modifies the form or closes the modal."
        }
      ]
    }
  ]
}