{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin authorization check for adding sarees",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Fix the AdminSarees page to ensure the addSaree mutation works correctly for users authenticated via the OwnerVerificationGate by adding proper error handling and user feedback when the backend authorization check fails.",
      "acceptanceCriteria": [
        "The Add New Saree form submits successfully for an admin authenticated via the OwnerVerificationGate.",
        "No 'Unauthorized' error banner appears when a valid admin submits the form.",
        "The saree is saved and appears in the admin saree list after submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminSarees.tsx",
          "operation": "modify",
          "description": "Update the addSaree mutation error handling to provide clearer feedback when authorization fails. Add a helper that checks if the user has passed the OwnerVerificationGate before attempting the mutation. If the mutation fails with an authorization error, display a detailed error message that instructs the user to refresh the page or re-authenticate. Also add logging to capture the full error details for debugging the backend authorization mismatch."
        },
        {
          "path": "frontend/src/hooks/useOwnerAuth.ts",
          "operation": "modify",
          "description": "Add a public method or exported helper that allows other components to check if the owner is currently verified according to sessionStorage. This will enable AdminSarees to verify the gate state before submitting the addSaree mutation and provide a better user experience."
        },
        {
          "path": "frontend/src/utils/retryWithBackoff.ts",
          "operation": "modify",
          "description": "Enhance the convertErrorToUserMessage function to recognize 'Unauthorized: Only admins can add sarees' errors and provide a specific user-facing message that explains the authorization issue and suggests re-authentication. This ensures that authorization errors from the backend are surfaced clearly to the user."
        }
      ]
    }
  ]
}