{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix saree catalog sync: admin uploads not reflecting in user panel",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Invalidate React Query cache after admin saree operations to immediately reflect changes in user catalog",
      "acceptanceCriteria": [
        "After submitting a new saree in the admin panel, the saree appears in the user-facing catalog without a page reload.",
        "After editing an existing saree in the admin panel, the updated details (including image) are reflected in the catalog without a page reload.",
        "The React Query query key used to fetch sarees in Catalog.tsx is invalidated upon successful add/update mutations in AdminSarees.tsx.",
        "No stale saree data is shown in the catalog after an admin operation completes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and ensure the saree mutation hooks (useAddSaree, useUpdateSaree, useDeleteSaree) are properly invalidating the React Query cache using queryClient.invalidateQueries with the shared 'sarees' query key upon successful mutation completion. Verify that the saree list query key is consistent and that the invalidation triggers re-fetch in both AdminSarees and Catalog pages."
        },
        {
          "path": "frontend/src/pages/AdminSarees.tsx",
          "operation": "modify",
          "description": "Verify that after successful saree add, update, or delete operations, the component properly awaits the mutation and ensures cache invalidation completes. Add user feedback (toast/notification) confirming the operation succeeded and the catalog has been refreshed. Ensure the form reset and modal close happen only after cache invalidation, so the user sees the updated catalog state immediately."
        },
        {
          "path": "frontend/src/pages/Catalog.tsx",
          "operation": "modify",
          "description": "Audit the saree list query usage to confirm it uses the same query key as the admin mutations, and that no staleTime or cacheTime settings are preventing re-fetch after invalidation. Ensure the component properly shows loading state during re-fetch and displays fresh data once the invalidated query resolves."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Audit saree list query to ensure consistent query key and proper re-fetch behavior after cache invalidation",
      "acceptanceCriteria": [
        "The saree list query key in useQueries.ts is a single shared constant referenced by both the admin and catalog pages.",
        "Invalidating the saree list query key triggers a re-fetch in the Catalog page.",
        "The useSarees (or equivalent) query does not use staleTime or cacheTime settings that would prevent re-fetching after invalidation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extract the 'sarees' query key into a shared constant (e.g., QUERY_KEYS.SAREES) at the top of the file. Ensure all saree-related queries and mutations reference this constant. Review the useSarees query configuration to remove or adjust any staleTime/cacheTime settings that could prevent immediate re-fetch after invalidation. Confirm that the queryFn properly calls actor.getAllSarees() and that the query is enabled when the actor is available."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure saree images uploaded via admin are correctly fetched and rendered in catalog after cache invalidation",
      "acceptanceCriteria": [
        "Newly added sarees display their uploaded image correctly in the catalog.",
        "The image blob data returned from the backend is properly converted to a displayable URL (e.g., via a Blob URL or base64) in the Catalog page.",
        "No broken image icons appear for freshly added sarees."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Catalog.tsx",
          "operation": "modify",
          "description": "Review the image rendering logic for saree cards. Verify that when a saree.image (ExternalBlob) is present, the component calls getDirectURL() to obtain a displayable URL. Use the blob-storage component's ExternalBlob.getDirectURL() method to generate a browser-cached HTTP URL for each saree image. Ensure fallback to the placeholder image (frontend/public/assets/generated/saree-placeholder.dim_400x500.png) only when saree.image is null or undefined. Add error handling for image load failures to prevent broken image icons."
        },
        {
          "path": "frontend/src/pages/AdminSarees.tsx",
          "operation": "modify",
          "description": "Verify that uploaded images are converted to ExternalBlob using ExternalBlob.fromBytes() before being passed to the addSaree or updateSaree mutations. Ensure the image compression utility (frontend/src/utils/imageCompression.ts) is applied before creating the ExternalBlob. Confirm that the image preview in the admin form also uses getDirectURL() for consistency with the catalog rendering. Verify the component's usage instructions from the blob-storage component before implementing any changes."
        }
      ]
    }
  ]
}